#+title:Chapter 1 Building Abstractions with procedures 

* 1.1.6 Conditional Expressions and Predicates

** Exercise 1.2
Translate the following expression into prefix form.

$$\frac{5 + 4 + (2 - (3 - (6 + \frac{4}{5})))}{3(6 - 2)(2 - 7)}$$

#+BEGIN_SRC emacs-lisp
(/ (+ 5
      4
      (- 2
         (- 3
            (+ 6
               (/ 4.0 5)))))
   (* 3
      (- 6 2)
      (- 2 7)))
#+END_SRC

#+RESULTS:
: -0.24666666666666667

** Exercise 1.3
Define a procedure that takes three numbers as arguments and returns the sum of the squares of the two larger numbers.

#+BEGIN_SRC emacs-lisp
(defun square (x) (* x x))

(defun sum-of-squares (a b)
  (+ (square a) (square b)))

(defun sum-of-squares-largest-two (a b c)
  (cond
   ((<= a b c) (sum-of-squares b c))
   ((<= b a c) (sum-of-squares a c))
   (t (sum-of-squares a b))))

(sum-of-squares-largest-two 1 2 3)
#+END_SRC

#+RESULTS:
: 13

** Exercise 1.7
The good-enough? test used in computing square roots will not be very effective for finding the square roots of very small numbers. Also, in real computers, arithmetic operations are almost always performed with limited precision. This makes our test inadequate for very large numbers.

*** The problem with the original approach

The original =good-enough?= checks if =|guess² - x| < 0.001=. This fixed tolerance fails in two ways:

*For small numbers:* If x = 0.0001, the actual square root is 0.01. But our tolerance of 0.001 is 10% of the answer! We might accept 0.03 as "good enough" when it's wildly wrong.

*For large numbers:* If x = 10000000000000 (10^13), floating point precision means we can't represent differences smaller than ~1. The algorithm might never terminate because we can't get within 0.001 of the answer, or it oscillates forever.

#+BEGIN_SRC emacs-lisp
;; Original (broken) implementation
(defun square (x) (* x x))

(defun average (a b) (/ (+ a b) 2.0))

(defun improve (guess x)
  (average guess (/ x guess)))

(defun good-enough? (guess x)
  (< (abs (- (square guess) x)) 0.001))

(defun sqrt-iter (guess x)
  (if (good-enough? guess x)
      guess
    (sqrt-iter (improve guess x) x)))

(defun bad-sqrt (x)
  (sqrt-iter 1.0 x))

;; Test with small number - inaccurate result
(bad-sqrt 0.0001)  ; gives ~0.03, should be 0.01
#+END_SRC

#+RESULTS:
: 0.03230844833048122

*** Improved implementation

#+BEGIN_SRC emacs-lisp
(defun square (x) (* x x))

(defun average (a b) (/ (+ a b) 2.0))

(defun improve (guess x)
  (average guess (/ x guess)))

(defun good-enough? (guess previous-guess)
  (< (abs (- guess previous-guess))
     (* guess 0.00001)))

(defun sqrt-iter (guess previous-guess x)
  (if (good-enough? guess previous-guess)
      guess
    (sqrt-iter (improve guess x) guess x)))

(defun better-sqrt (x)
  (sqrt-iter 1.0 0.0 x))

;; Test both implementations
(list
 (cons "small (0.0001):" (better-sqrt 0.0001))
 (cons "normal (2):" (better-sqrt 2))
 (cons "large (1e13):" (better-sqrt 1e13)))
#+END_SRC

#+RESULTS:
: ((small (0.0001): . 0.01) (normal (2): . 1.4142135623746899) (large (1e13): . 3162277.6601683795))

** Exercise 1.8
Newton's method for cube roots is based on the fact that if y is an approximation to the cube root of x, then a better approximation is given by the value

$$\frac{x/y^2 + 2y}{3}$$

Use this formula to implement a cube-root procedure analogous to the square-root procedure.

#+BEGIN_SRC emacs-lisp
(defun square (x) (* x x))

(defun cube (x) (* x x x))

(defun improve-cube (guess x)
  (/ (+ (/ x (square guess))
        (* 2 guess))
     3.0))

(defun good-enough? (guess previous-guess)
  (< (abs (- guess previous-guess))
     (* (abs guess) 0.00001)))

(defun cbrt-iter (guess previous-guess x)
  (if (good-enough? guess previous-guess)
      guess
    (cbrt-iter (improve-cube guess x) guess x)))

(defun cbrt (x)
  (cbrt-iter 1.0 0.0 x))

(list
 (cons "cbrt(8):" (cbrt 8))
 (cons "cbrt(27):" (cbrt 27))
 (cons "cbrt(1000):" (cbrt 1000))
 (cons "cbrt(0.001):" (cbrt 0.001))
 (cons "cbrt(-8):" (cbrt -8)))
#+END_SRC

#+RESULTS:
: ((cbrt(8): . 2.000000000012062) (cbrt(27): . 3.0000000000000977) (cbrt(1000): . 10.000000000000002) (cbrt(0.001): . 0.10000000000000005) (cbrt(-8): . -2.0))

** Exercise 1.11
A function $f$ is defined by the rule that $f(n) = n$ if $n < 3$ and $f(n) = f(n-1) + 2f(n-2) + 3f(n-3)$ if $n \geq 3$.

*** Recursive Process
#+BEGIN_SRC racket :lang sicp :results output
(define (f n)
  (if (< n 3)
      n
      (+ (f (- n 1))
         (* 2 (f (- n 2)))
         (* 3 (f (- n 3))))))
#+END_SRC

*** Iterative Process
#+BEGIN_SRC racket :lang sicp :results output
(define (f n)
  (define (f-iter a b c count)
    (if (< count 3)
        a
        (f-iter (+ a (* 2 b) (* 3 c))
                a
                b
                (- count 1))))
  (if (< n 3)
      n
      (f-iter 2 1 0 n)))
#+END_SRC

#+RESULTS:

** Exercise 1.12
Write a procedure that computes elements of Pascal's triangle by means of a recursive process.

Each element is the sum of the two elements above it, with 1s on the edges.

#+BEGIN_SRC racket :lang sicp :results output
(define (pascal row col)
(cond ((= col 0) 1)
        ((= col row) 1)
        (else (+ (pascal (- row 1) (- col 1))
                (pascal (- row 1) col)))))

(display (pascal 0 0)) (newline)
(display (pascal 2 1)) (newline)
(display (pascal 4 2)) (newline)
#+END_SRC

#+RESULTS:
: 1
: 2
: 6

** Exercise 1.14.
Draw the tree illustrating the process generated by the count-change procedure of section 1.2.2 in making change for 11 cents. What are the orders of growth of the space and number of steps used by this process as the amount to be changed increases


#+BEGIN_SRC racket :lang sicp :results output
(define (count-change amount)
  (cc amount 5))

(define (cc amount kinds-of-coins)
  (cond ((= amount 0) 1)
        ((or (< amount 0) (= kinds-of-coins 0)) 0)
        (else (+ (cc amount (- kinds-of-coins 1))
                 (cc (- amount (first-denomination kinds-of-coins))
                     kinds-of-coins)))))

(define (first-denomination kinds-of-coins)
  (cond ((= kinds-of-coins 1) 1)
        ((= kinds-of-coins 2) 5)
        ((= kinds-of-coins 3) 10)
        ((= kinds-of-coins 4) 25)
        ((= kinds-of-coins 5) 50)))

(count-change 11)  ; => 4
#+END_SRC

#+RESULTS:
: 4

** Exercise 1.16.
Design a procedure that evolves an iterative exponentiation process that uses successive squaring and uses a logarithmic number of steps, as does fast-expt. (Hint: Using the observation that (bn/2)2 = (b2)n/2, keep, along with the exponent n and the base b, an additional state variable a, and define the state transformation in such a way that the product a bn is unchanged from state to state. At the beginning of the process a is taken to be 1, and the answer is given by the value of a at the end of the process. In general, the technique of defining an invariant quantity that remains unchanged from state to state is a powerful way to think about the design of iterative algorithms.)

#+BEGIN_SRC racket :lang sicp :results output
(define (fast-expt b n)
  (define (iter a b n)
    (cond ((= n 0) a)
        ((even? n) (iter a (* b b) (/ n 2)))
        (else (iter (* a b) b (- n 1)))))
(iter 1 b n))

(display (fast-expt 2 0))  (newline) 
(display (fast-expt 2 1))  (newline) 
(display (fast-expt 2 10)) (newline)  
#+END_SRC

#+RESULTS:
: 1
: 2
: 1024

** Exercise 1.17.
The exponentiation algorithms in this section are based on performing exponentiation by means of repeated multiplication. In a similar way, one can perform integer multiplication by means of repeated addition. The following multiplication procedure (in which it is assumed that our language can only add, not multiply) is analogous to the expt procedure:

(define (* a b)
  (if (= b 0)
      0
      (+ a (* a (- b 1)))))

This algorithm takes a number of steps that is linear in b. Now suppose we include, together with addition, operations double, which doubles an integer, and halve, which divides an (even) integer by 2. Using these, design a multiplication procedure analogous to fast-expt that uses a logarithmic number of steps.

#+BEGIN_SRC racket :lang sicp :results output
(define (double x) (+ x x ))
(define (halve x) (/ x 2))

(define (fast-mult a b)
  (cond ((= b 0) 0)
        ((even? b) (double (fast-mult a (halve b))))
        (else (+ a (fast-mult a (- b 1))))))

(display (fast-mult 3 0))  (newline)   ; 0
(display (fast-mult 3 4))  (newline)   ; 12
(display (fast-mult 5 7))  (newline)   ; 35
(display (fast-mult 12 13)) (newline)  ; 156
#+END_SRC

#+RESULTS:
: 0
: 12
: 35
: 156

** Exercise 1.18.
Using the results of exercises 1.16 and 1.17, devise a procedure that generates an iterative process for multiplying two integers in terms of adding, doubling, and halving and uses a logarithmic number of steps.

#+BEGIN_SRC racket :lang sicp :results output
(define (double x) (+ x x ))
(define (halve x) (/ x 2))

(define (fast-mult a b)
  (define (iter acc a b)
    (cond ((= b 0) acc)
          ((even? b) (iter acc (double a) (halve b)))
          (else (iter (+ acc a) a (- b 1)))))
  (iter 0 a b))

(display (fast-mult 3 0))  (newline)   ; 0
(display (fast-mult 3 4))  (newline)   ; 12
(display (fast-mult 5 7))  (newline)   ; 35
(display (fast-mult 12 13)) (newline)  ; 156
#+END_SRC

** Exercise 1.19.
There is a clever algorithm for computing the Fibonacci numbers in a logarithmic number of steps. Recall the transformation of the state variables a and b in the fib-iter process of section 1.2.2: a ← a + b and b ← a. Call this transformation T, and observe that applying T over and over again n times, starting with 1 and 0, produces the pair Fib(n + 1) and Fib(n). In other words, the Fibonacci numbers are produced by applying T^n, the nth power of the transformation T, starting with the pair (1,0). Now consider T to be the special case of p = 0 and q = 1 in a family of transformations T_pq, where T_pq transforms the pair (a,b) according to a ← bq + aq + ap and b ← bp + aq. Show that if we apply such a transformation T_pq twice, the effect is the same as using a single transformation T_p'q' of the same form, and compute p' and q' in terms of p and q. This gives us an explicit way to square these transformations, and thus we can compute T^n using successive squaring, as in the fast-expt procedure. Put this all together to complete the following procedure, which runs in a logarithmic number of steps:

#+BEGIN_SRC racket :lang sicp :results output
(define (fib n)
  (fib-iter 1 0 0 1 n))
(define (fib-iter a b p q count)
  (cond ((= count 0) b)
        ((even? count)
         (fib-iter a
                   b
                   (+ (* p p) (* q q))
                   (+ (* 2 p q) (* q q))
                   (/ count 2)))
        (else (fib-iter (+ (* b q) (* a q) (* a p))
                        (+ (* b p) (* a q))
                        p
                        q
                        (- count 1)))))

(display (fib 0))  (newline)
(display (fib 1))  (newline)
(display (fib 10)) (newline)
(display (fib 20)) (newline)
#+END_SRC

#+RESULTS:
: 0
: 1
: 55
: 6765

** Exercise 1.21.
Use the smallest-divisor procedure to find the smallest divisor of each of the following numbers: 199, 1999, 19999.

#+BEGIN_SRC racket :lang sicp :results output
(define (smallest-divisor n)
  (find-divisor n 2))

(define (find-divisor n test-divisor)
  (cond ((> (square test-divisor) n) n)
        ((divides? test-divisor n) test-divisor)
        (else (find-divisor n (+ test-divisor 1)))))

(define (divides? a b)
  (= (remainder b a) 0))

(define (square x) (* x x))
#+END_SRC

** Exercise 1.22.
Most Lisp implementations include a primitive called runtime that returns an integer that specifies the amount of time the system has been running (measured, for example, in microseconds). Using timed-prime-test, write a procedure search-for-primes that checks the primality of consecutive odd integers in a specified range. Use your procedure to find the three smallest primes larger than 1000; larger than 10,000; larger than 100,000; larger than 1,000,000. Note the time needed to test each prime. Since the testing algorithm has order of growth of Θ(√n), you should expect that testing for primes around 10,000 should take about √10 times as long as testing for primes around 1000. Do your timing data bear this out?

#+BEGIN_SRC racket :lang sicp :results output
(define (square x) (* x x))

(define (smallest-divisor n)
  (find-divisor n 2))

(define (find-divisor n test-divisor)
  (cond ((> (square test-divisor) n) n)
        ((divides? test-divisor n) test-divisor)
        (else (find-divisor n (+ test-divisor 1)))))

(define (divides? a b)
  (= (remainder b a) 0))

(define (prime? n)
  (= n (smallest-divisor n)))

(define (timed-prime-test n)
  (newline)
  (display n)
  (start-prime-test n (runtime)))

(define (start-prime-test n start-time)
  (if (prime? n)
      (report-prime (- (runtime) start-time))))

(define (report-prime elapsed-time)
  (display " *** ")
  (display elapsed-time))

;; start from n, check odd only, stop when count primes
(define (search-for-primes start count)
  (cond ((+ count 0) (newline) (display "done"))
        ((even? start) (search-for-primes (+ start 1) count))
        ((prime? start)
         (timed-prime-test start)
         (search-for-primes (+ start 2) (- count 1)))
        (else (search-for-primes (+ start 2) count))))

(search-for-primes 1000 3)
(search-for-primes 10000 3)
(search-for-primes 100000 3)
(search-for-primes 1000000 3)
#+END_SRC

#+RESULTS:
: 
: done
: done
: done
: done

** Exercise 1.24.
Modify the timed-prime-test procedure of exercise 1.22 to use fast-prime? (the Fermat method), and test each of the 12 primes you found in that exercise. Since the Fermat test has Θ(log n) growth, how would you expect the time to test primes near 1,000,000 to compare with the time needed to test primes near 1000? Do your data bear this out? Can you explain any discrepancy you find?

#+BEGIN_SRC racket :lang sicp :results output
(define (square x) (* x x))

(define (expmod base exp m)
  (cond ((= exp 0) 1)
        ((even? exp)
         (remainder (square (expmod base (/ exp 2) m))
                    m))
        (else
         (remainder (* base (expmod base (- exp 1) m))
                    m))))

(define (fermat-test n)
  (define (try-it a)
    (= (expmod a n n) a))
  (try-it (+ 1 (random (- n 1)))))

(define (fast-prime? n times)
  (cond ((= times 0) true)
        ((fermat-test n) (fast-prime? n (- times 1)))
        (else false)))

(define (timed-prime-test n)
  (newline)
  (display n)
  (start-prime-test n (runtime)))

(define (start-prime-test n start-time)
  (if (fast-prime? n 10)
      (report-prime (- (runtime) start-time))))

(define (report-prime elapsed-time)
  (display " *** ")
  (display elapsed-time))

(timed-prime-test 1000003)
(timed-prime-test 1000033)
(timed-prime-test 1000037)
#+END_SRC

#+RESULTS:
: 
: 1000003 *** 7
: 1000033 *** 3
: 1000037 *** 3

** Exercise 1.29.
Simpson's Rule is a more accurate method of numerical integration than the method illustrated above. Using Simpson's Rule, the integral of a function =f= between =a= and =b= is approximated as

= (h/3)(y_0 + 4y_1 + 2y_2 + 4y_3 + 2y_4 + ... + 2y_(n-2) + 4y_(n-1) + y_n) =

where =h = (b - a) / n=, for some even integer =n=, and =y_k = f(a + kh)=. (Increasing =n= increases the accuracy of the approximation.) Define a procedure that takes as arguments =f=, =a=, =b=, and =n= and returns the value of the integral, computed using Simpson's Rule. Use your procedure to integrate =cube= between 0 and 1 (with =n= = 100 and =n= = 1000), and compare the results to those of the integral procedure shown above.

#+BEGIN_SRC racket :lang sicp :results output
(define (sum term a next b)
  (if (> a b)
      0
      (+ (term a)
         (sum term (next a) next b))))

(define (inc n) (+ n 1))

(define (simpson f a b n)
  (define h (/ (- b a) n))
  (define (y k)
    (f (+ a (* k h))))
  (define (coefficient k)
    (cond ((or (= k 0) (= k n)) 1)
          ((even? k) 2)
          (else 4)))
  (define (term k)
    (* (coefficient k) (y k)))
  (* (/ h 3)
     (sum term 0 inc n)))

(define (cube x) (* x x x))

(simpson cube 0 1 100)
#+END_SRC

#+RESULTS:
: 1/4


** Exercise 1.30.
The =sum= procedure above generates a linear recursion. The procedure can be rewritten so that the sum is performed iteratively. Show how to do this by filling in the missing expressions in the following definition:

#+BEGIN_SRC racket :lang sicp :results output
(define (sum term a next b)
  (define (iter current result)
    (if (> current b)
        result
        (iter (next current)
              (+ result (term current)))))
  (iter a 0))

(define (inc n) (+ n 1))
(define (identity x) x)
(define (cube x) (* x x x))

(display (sum identity 1 inc 4)) (newline)
(display (sum cube 1 inc 3)) (newline)
#+END_SRC

#+RESULTS:
: 10
: 36
